TEMPLATE_ALIGNMENT_RIGHT = [
    'ТАБЕЛЬ ВЫПОЛНЯЕМЫХ РАБОТ за',
    'Таб. номер:',
    'Должность:',
    'Ответственный за учет:',
    'Зайцев А.А.',
    'Руководитель подразделения:',
    'Малинин Д.Ю.',
    'Работник:',
]

TEMPLATE_CLARIFICATION = [
    'фамилия и инициалы',
    'должность',
    'личная подпись, фамилия и инициалы',
]

TEMPLATE_TABLE = [
    '№\nп/п',
    'Производственный заказ, объект,\nнаименование, конструктив, тип\nвыполняемой работы и тд',
    'Норматив',
    'Дни месяца',
    'Итого\nчасов',
    'Итого за первую половину месяца',
    'Итого за вторую половину месяца',
    'ИТОГО',
]
